Week 4/w4d1/First_Routes/app/controllers/contacts_controller.rb

  def index
    @user = User.find(params[:user_id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 6]]

  def update
    @contact = Contact.find(params[:id])
    if @contact.update(contact_params)
---
SELECT  "contacts".* FROM "contacts"  WHERE "contacts"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "contacts" SET "email" = ?, "name" = ?, "updated_at" = ? WHERE "contacts"."id" = 2  [["email", "Shitlord@shitfuckplanetshitass.com"], ["name", "Shitty"], ["updated_at", "2014-10-27 23:15:45.052449"]]

  def show
    @contact = Contact.find(params[:id])
---
SELECT  "contacts".* FROM "contacts"  WHERE "contacts"."id" = ? LIMIT 1  [["id", 1]]