Week 4/w4d1/First_Routes/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("created_at", "updated_at", "username") VALUES (?, ?, ?)  [["created_at", "2014-10-28 00:40:26.510652"], ["updated_at", "2014-10-28 00:40:26.510652"], ["username", "Fuck"]]

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "updated_at" = ?, "username" = ? WHERE "users"."id" = 4  [["updated_at", "2014-10-27 22:50:21.556870"], ["username", "YES_RYAN"]]

  def destroy
    @user = User.find(params[:id])
    @user.delete
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "users" WHERE "users"."id" = 1